## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_security_group_rule.ecs_egress_database`                                           |
|        | `aws_security_group_rule.ecs_ingress_lb`                                                |
| update | `aws_security_group.ecs_tasks`                                                          |
|        | `module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow ECS security group to send all traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
        id                     = "sg-085c606383f33733e"
        name                   = "ai-answers-security-group"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the DocumentDB cluster"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-04966047bf236b850"
      + to_port                  = 27017
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "ecs_ingress_lb" {
      + description              = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08e35f1019824d56a"
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "ai-answers-cluster"
      ~ last_modified                  = "2025-03-28T16:24:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "HBr+yq+1I0J3FirYAqWtzdc18ZJdwgcRm6tSHU6l2TQ=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "ai-answers-staging"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
